bookshelf/app/controllers/api/authors_controller.rb

        scope = scope.left_joins(:books).group(:id).select("authors.*, COUNT(books.id) AS book_count")
---
SELECT COUNT(*) AS "count_all", "authors"."id" AS "authors_id" FROM "authors" LEFT OUTER JOIN "books" ON "books"."author_id" = "authors"."id" GROUP BY "authors"."id"

    def create
      author = Author.new(author_params)

      if author.save
---
INSERT INTO "authors" ("first_name", "last_name", "bio", "birth_year", "death_year", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
      if @author.update(author_params)
---
UPDATE "authors" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "Updated"], ["last_name", "Name"], ["updated_at", "2026-04-03 10:46:51.505269"], ["id", 1]]

    def destroy
      if @author.books.exists?
        book_count = @author.books.count
        raise DependencyExistsError, "Cannot delete author: #{book_count} #{"book".pluralize(book_count)} are associated with this author"
      end

      @author.destroy!
---
SELECT 1 AS one FROM "books" WHERE "books"."author_id" = ? LIMIT ?  [["author_id", 1], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]